app/Answer.php

public static function boot() {
    parent::boot();

    static::created(function($answer) {
        $answer->question->increment('answers_count');

    });


    static::deleted(function($answer) {

        $answer->question->decrement('answers_count');

    });

    /*

    when saved
    static::saved(function($answer) {
        echo "answer saved\n";

    });
---
update `questions` set `answers_count` = `answers_count` + 1, `questions`.`updated_at` = '2020-03-10 10:20:24' where `id` = 2
update `questions` set `answers_count` = `answers_count` - 1, `questions`.`updated_at` = '2020-03-10 11:14:14' where `id` = 2
update `questions` set `best_answer_id` = '', `questions`.`updated_at` = '2020-03-10 10:43:26' where `id` = 2