app/Http/Controllers/AnswersController.php

    public function update(Request $request, Question $question, Answer $answer)
    {
        $this->authorize('update', $answer);
        $answer->update($request->validate([
            'body' => 'required',
        ]));
---
update `answers` set `body` = 'I can also answer this one;  well ok just have to revise this answer', `answers`.`updated_at` = '2020-03-10 09:50:06' where `id` = 25

    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete', $answer);  // check the AnswerPolicy file
        $answer->delete();
---
delete from `answers` where `id` = 26