app/Http/Controllers/QuestionsController.php

    public function index()
    {
        $questions = Question::with('user')->latest()->paginate(10);
---
select * from `questions` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `questions`

    public function show(Question $question)
    {

        $question->increment('views');
---
update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-03-10 10:36:04' where `id` = 2

    public function destroy(Question $question)
    {
        /*
        if (\Gate::denies('delete-question', $question)) {
            abort(403, "Access denied");
        } */

        $this->authorize("delete", $question);
        $question->delete();
---
delete from `questions` where `id` = 13