app/Http/Controllers/QuestionsController.php

    public function index()
    {
        $questions = Question::latest()->paginate(5);
---
select * from `questions` order by `created_at` desc limit 5 offset 0