app/Providers/RouteServiceProvider.php

select * from `answers` where `answers`.`question_id` in (2)
select * from `questions` where `slug` = 'consectetur-molestiae-non-ut-praesentium' limit 1
select * from `users` where `users`.`id` in (1, 2, 3, 4)
---
    public function boot()
    {
        Route::bind('slug', function($slug) {
    /*      $question =Question::where('slug', $slug)->first();
            return $question ? $question : abort(404); */

           return Question::with('answers.user')->where('slug', $slug)->first() ?? abort(404);